In [2]:
import pandas as pd
import numpy as np

In [4]:
s = pd.Series([0.3, 00.5, 0.42, 0.9])

In [5]:
s

0    0.30
1    0.50
2    0.42
3    0.90
dtype: float64

In [6]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
s.values

array([0.3 , 0.5 , 0.42, 0.9 ])

In [8]:
s[0]

0.3

In [14]:
s.values[-1]

0.9

In [36]:
s2 = pd.Series([5, 6, 8, 9, np.nan], index=["banane", "kiwi", "pomme", "poire", "ananas"])

In [37]:
s2

banane    5.0
kiwi      6.0
pomme     8.0
poire     9.0
ananas    NaN
dtype: float64

In [17]:
s2.index

Index(['banane', 'kiwi', 'pomme', 'poire'], dtype='object')

In [18]:
s2 > 6

banane    False
kiwi      False
pomme      True
poire      True
dtype: bool

In [19]:
s2[s2 > 6]

pomme    8
poire    9
dtype: int64

In [20]:
s2 * 2

banane    10
kiwi      12
pomme     16
poire     18
dtype: int64

In [21]:
np.exp(s2)

banane     148.413159
kiwi       403.428793
pomme     2980.957987
poire     8103.083928
dtype: float64

In [22]:
"kiwi" in s2

True

In [23]:
s2

banane    5
kiwi      6
pomme     8
poire     9
dtype: int64

In [25]:
5 in s2.values

True

In [33]:
s2[s2 > 6][["pomme"]]

pomme    8
dtype: int64

In [38]:
s2.isnull()

banane    False
kiwi      False
pomme     False
poire     False
ananas     True
dtype: bool

In [39]:
s2.notnull()

banane     True
kiwi       True
pomme      True
poire      True
ananas    False
dtype: bool

In [40]:
s2 + s2

banane    10.0
kiwi      12.0
pomme     16.0
poire     18.0
ananas     NaN
dtype: float64

# DataFrame

In [26]:
data = {
    "city": ["Paris", "London", "Berlin"],
    "density": [3550, 5100, 3750],
    "area": [2723, 1623, 984],
    "population": [9645000, 8278000, 3675000],
}

df = pd.DataFrame(data)

In [5]:
df

     city  density  area  population
0   Paris     3550  2723     9645000
1  London     5100  1623     8278000
2  Berlin     3750   984     3675000

In [44]:
type(df["city"])

pandas.core.series.Series

In [48]:
df["city"]

0     Paris
1    London
2    Berlin
Name: city, dtype: object

In [49]:
df.city

0     Paris
1    London
2    Berlin
Name: city, dtype: object

In [50]:
df.dtypes

city          object
density        int64
area           int64
population     int64
dtype: object

In [51]:
df.describe()

           density         area    population
count     3.000000     3.000000  3.000000e+00
mean   4133.333333  1776.666667  7.199333e+06
std     843.109325   879.625110  3.127757e+06
min    3550.000000   984.000000  3.675000e+06
25%    3650.000000  1303.500000  5.976500e+06
50%    3750.000000  1623.000000  8.278000e+06
75%    4425.000000  2173.000000  8.961500e+06
max    5100.000000  2723.000000  9.645000e+06

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   city        3 non-null      object
 1   density     3 non-null      int64
 2   area        3 non-null      int64
 3   population  3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [53]:
df.values

array([['Paris', 3550, 2723, 9645000],
       ['London', 5100, 1623, 8278000],
       ['Berlin', 3750, 984, 3675000]], dtype=object)

In [54]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [47]:
type(df[["city"]])

pandas.core.frame.DataFrame

In [56]:
df.columns

Index(['city', 'density', 'area', 'population'], dtype='object')

In [27]:
df.set_index("city")

        density  area  population
city
Paris      3550  2723     9645000
London     5100  1623     8278000
Berlin     3750   984     3675000

In [25]:
#df.set_index(["density", "city"])

                area  population
density city
3550    Paris   2723     9645000
        London  1623     8278000
3750    Berlin   984     3675000

In [61]:
df_2 = df.set_index("city")

In [ ]:
# immutable

In [65]:
df_2.reset_index()

     city  density  area  population
0   Paris     3550  2723     9645000
1  London     5100  1623     8278000
2  Berlin     3750   984     3675000

In [66]:
df

     city  density  area  population
0   Paris     3550  2723     9645000
1  London     5100  1623     8278000
2  Berlin     3750   984     3675000

In [68]:
df["population"] / df["area"]

0    3542.049210
1    5100.431300
2    3734.756098
dtype: float64

In [69]:
df["density"] > 4000

0    False
1     True
2    False
Name: density, dtype: bool

In [70]:
df[df["density"] > 4000]

     city  density  area  population
1  London     5100  1623     8278000

In [71]:
df["area"]

0    2723
1    1623
2     984
Name: area, dtype: int64

In [72]:
df[["area", "city"]]

   area    city
0  2723   Paris
1  1623  London
2   984  Berlin

In [74]:
df

     city  density  area  population
0   Paris     3550  2723     9645000
1  London     5100  1623     8278000
2  Berlin     3750   984     3675000

In [73]:
# df.loc                and df.iloc
#    ^ via les labels          ^ via les index numeriques

In [75]:
df.loc[1:2, ["city", "density", "area"]]

     city  density  area
1  London     5100  1623
2  Berlin     3750   984

In [82]:
df.iloc[1:3, 0:3]

     city  density  area
1  London     5100  1623
2  Berlin     3750   984

In [84]:
df.iloc[1, 2] = 3450

In [85]:
df

     city  density  area  population
0   Paris     3550  2723     9645000
1  London     5100  3450     8278000
2  Berlin     3750   984     3675000

In [29]:
df = pd.read_csv("world population.csv")

# read_sql -> Postgresql, MySQL

In [103]:
df

            City / Urban area      Country  Population Land area Density
0              Tokyo/Yokohama        Japan  33,200,000     6,993   4,750
1              New York Metro          USA  17,800,000     8,683   2,050
2                   Sao Paulo       Brazil  17,700,000     1,968   9,000
3               Seoul/Incheon  South Korea  17,500,000     1,049  16,700
4                 Mexico City       Mexico  17,400,000     2,072   8,400
..                        ...          ...         ...       ...     ...
120                Copenhagen      Denmark   1,525,000       816   1,850
121                  Brisbane    Australia   1,508,000     1,603     950
122  Riverside/San Bernardino          USA   1,507,000     1,136   1,350
123                Cincinnati          USA   1,503,000     1,740     850
124                     Accra        Ghana   1,500,000       453   3,300

[125 rows x 5 columns]

# Calculer la somme de la colonne population

In [104]:
# df.loc[2, "Population"] = np.nan

In [33]:
df["Population"].str.replace(",", "").fillna(0).astype(int).sum()
df["Population"] = df["Population"].str.replace(",", "").fillna(0).astype(int)

In [34]:
df["Population"].sum()

660404000

# Créer une colonne `real_density` à partir de population et area

In [36]:
df["Land area"] = df["Land area"].str.replace(",", "").fillna(0).astype(int)

In [37]:
df["Real density"] = df["Population"] / df["Land area"]

# Calculer la population totale par pays

In [80]:
df.groupby("Country")["Population"].sum()

Country
Argentina        11200000
Australia         8172000
Austria           1550000
Azerbaijan        2100000
Belgium           1570000
Brazil           46850000
Canada            9413000
Chile             5425000
China            38314000
Colombia          7000000
Congo             5000000
Denmark           1525000
Egypt            12200000
France            9645000
Germany          18770000
Ghana             1500000
Greece            3685000
Hungary           1800000
India            58000000
Indonesia        14250000
Iran              7250000
Iraq              5500000
Israel            2300000
Italy             9150000
Japan            62850000
Kuwait            1600000
Lebanon           1800000
Malaysia          4400000
Mexico           24100000
Nigeria          13400000
Pakistan         14900000
Peru              7000000
Philippines      14750000
Poland            4200000
Portugal          2250000
Puerto Rico       2217000
Russia           15800000
Saudi Arabia      8275000
Singapore         4000000
South Africa     13450000
South Korea      17500000
Spain             8800000
Sudan             4000000
Taiwan            7700000
Thailand          6500000
Turkey           12100000
UAE               1900000
UK               12807000
USA             103086000
Uzbekistan        2200000
Vietnam           4900000
Zimbabwe          1750000
Name: Population, dtype: int64

In [85]:
df.groupby("Country").agg({"Population": sum, "Real density": np.mean})

              Population  Real density
Country
Argentina       11200000   4942.630185
Australia        8172000   1512.267587
Austria          1550000   3421.633554
Azerbaijan       2100000   3860.294118
Belgium          1570000   2205.056180
Brazil          46850000   5337.032715
Canada           9413000   2040.291709
Chile            5425000   8371.913580
China           38314000  11485.805604
Colombia         7000000  13513.513514
Congo            5000000  10660.980810
Denmark          1525000   1868.872549
Egypt           12200000   9420.849421
France           9645000   3542.049210
Germany         18770000   2771.054346
Ghana            1500000   3311.258278
Greece           3685000   5387.426901
Hungary          1800000   2564.102564
India           58000000  16363.936361
Indonesia       14250000  10477.941176
Iran             7250000  10568.513120
Iraq             5500000   9228.187919
Israel           2300000   5077.262693
Italy            9150000   3273.545651
Japan           62850000   4649.665790
Kuwait           1600000   2941.176471
Lebanon          1800000   2777.777778
Malaysia         4400000   2739.726027
Mexico          24100000   6983.583723
Nigeria         13400000  18157.181572
Pakistan        14900000  13559.137916
Peru             7000000  11744.966443
Philippines     14750000  10543.245175
Poland           4200000   4167.981570
Portugal         2250000   2553.916005
Puerto Rico      2217000    960.155912
Russia          15800000   6702.310626
Saudi Arabia     8275000   3146.095882
Singapore        4000000   8350.730689
South Africa    13450000   3171.777465
South Korea     17500000  16682.554814
Spain            8800000   5020.986117
Sudan            4000000   6861.063465
Taiwan           7700000   9540.571548
Thailand         6500000   6435.643564
Turkey          12100000   6518.010292
UAE              1900000   2668.539326
UK              12807000   4310.131819
USA            103086000   1345.330138
Uzbekistan       2200000   4143.126177
Vietnam          4900000   9459.459459
Zimbabwe         1750000   2457.865169

In [76]:
df.groupby("Country")["Population"].sum().sort_values(ascending=False)

Country
USA             103086000
Japan            62850000
India            58000000
Brazil           46850000
China            38314000
Mexico           24100000
Germany          18770000
South Korea      17500000
Russia           15800000
Pakistan         14900000
Philippines      14750000
Indonesia        14250000
South Africa     13450000
Nigeria          13400000
UK               12807000
Egypt            12200000
Turkey           12100000
Argentina        11200000
France            9645000
Canada            9413000
Italy             9150000
Spain             8800000
Saudi Arabia      8275000
Australia         8172000
Taiwan            7700000
Iran              7250000
Peru              7000000
Colombia          7000000
Thailand          6500000
Iraq              5500000
Chile             5425000
Congo             5000000
Vietnam           4900000
Malaysia          4400000
Poland            4200000
Singapore         4000000
Sudan             4000000
Greece            3685000
Israel            2300000
Portugal          2250000
Puerto Rico       2217000
Uzbekistan        2200000
Azerbaijan        2100000
UAE               1900000
Lebanon           1800000
Hungary           1800000
Zimbabwe          1750000
Kuwait            1600000
Belgium           1570000
Austria           1550000
Denmark           1525000
Ghana             1500000
Name: Population, dtype: int64

In [87]:
df["Country"].value_counts().head(3)

USA        26
Brazil      9
Germany     6
Name: Country, dtype: int64